import math
# Завдання 1
print("Programming***Essentials***in...Python")

# Завдання 2
print(" " * 4 + "*" + " " * 4 + "\n" +
      " " * 3 + "*" + " " + "*" + " " * 3 + "\n" +
      " " * 2 + "*" + " " * 3 + "*" + " " * 2 + "\n" +
      " " * 1 + "*" + " " * 5 + "*" + " " * 1 + "\n" +
      "*" * 3 + " " * 3 + "*" * 3 + "\n" +
      " " * 2 + "*" + " " * 3 + "*" + " " * 2 + "\n" +
      " " * 2 + "*" + " " * 3 + "*" + " " * 2 + "\n" + 
      " " * 2 + "*" * 5 + " " * 2
      )
# Завдання 3
print(
    "\"I'm\"" + "\n" + 
    "\"" * 2 + "learning" + "\"" * 2 + "\n" + 
    "\"" * 3 + "Python" + "\"" * 3
    )
# Завдання 4
print("I'm student")
# Завдання 5
print("500 у 8 ступені: ", 500 ** 8)
print("500 у 8 ступені з використанням модуля math: ", math.pow(500, 8))
# Завдання 6
print("777 у 16 ступені: ", 777 ** 16)
print("777 у 16 ступені з використанням модуля math: ", math.pow(777, 16))
